In [2]:
import pandas as pd
import numpy as np 

data = pd.read_csv('data_atm.csv')

df = pd.DataFrame(data=data)

print(df.dtypes)

Name               object
Account Number      int64
PIN                 int64
Balance             int64
Salary            float64
dtype: object

In [3]:
df.isnull().any(axis =0)

Name              False
Account Number    False
PIN               False
Balance           False
Salary             True
dtype: bool

In [4]:
df.fillna(0)

              Name  Account Number   PIN  Balance   Salary
0     Grace Yellow           45042  5185    69553  12733.0
1       Jane Smith           85965  3190    64865  19846.0
2    Alice Johnson           48360  1610    21162  13265.0
3     Grace Yellow           80624  9324    70408  14860.0
4    Alice Johnson           53525  8201    28238  19226.0
..             ...             ...   ...      ...      ...
98        John Doe           84953  9975    24869  17317.0
99      Jane Smith           21239  7272    52992      0.0
100     Raju Kumar            1138  9087     7834  12611.0
101     Raju Kumar            1138  9087     7834  15532.0
102     Raju Kumar            1138  9087     7834  16927.0

[103 rows x 5 columns]

In [5]:
df.isnull().any(axis =0)

Name              False
Account Number    False
PIN               False
Balance           False
Salary             True
dtype: bool

In [6]:
df['Salary'].isna()

0      False
1      False
2      False
3      False
4      False
       ...
98     False
99      True
100    False
101    False
102    False
Name: Salary, Length: 103, dtype: bool

In [14]:
# change Data type
df['New Account No.'] = df['Account Number'].astype(str)
df.head()

            Name  Account Number   PIN  Balance   Salary New Account No.
0   Grace Yellow           45042  5185    69553  12733.0           45042
1     Jane Smith           85965  3190    64865  19846.0           85965
2  Alice Johnson           48360  1610    21162  13265.0           48360
3   Grace Yellow           80624  9324    70408  14860.0           80624
4  Alice Johnson           53525  8201    28238  19226.0           53525

In [16]:
df['New Salary'] = df['Salary'].apply(lambda x:x+1000)
df.head()

,Name,Account Number,PIN,Balance,Salary,New Account No.,New Salary
0,Grace Yellow,45042,5185,69553,12733.0,45042,13733.0
1,Jane Smith,85965,3190,64865,19846.0,85965,20846.0
2,Alice Johnson,48360,1610,21162,13265.0,48360,14265.0
3,Grace Yellow,80624,9324,70408,14860.0,80624,15860.0
4,Alice Johnson,53525,8201,28238,19226.0,53525,20226.0

In [19]:
# Data Aggregation 

grouped_mean = df.groupby('Salary')['Balance'].mean()
print(grouped_mean)

Salary
10538.0    93004.0
10660.0    40410.0
10706.0    39200.0
10715.0    82576.0
10756.0    32775.0
            ...
19360.0    16290.0
19782.0    73928.0
19798.0    94627.0
19846.0    64865.0
19894.0    20668.0
Name: Balance, Length: 95, dtype: float64

In [21]:
gropued_salary_and_balance  = df.groupby('Salary')['Balance'].agg('mean' ,'sum' , 'count')
print(gropued_salary_and_balance)

Salary
10538.0    93004.0
10660.0    40410.0
10706.0    39200.0
10715.0    82576.0
10756.0    32775.0
            ...
19360.0    16290.0
19782.0    73928.0
19798.0    94627.0
19846.0    64865.0
19894.0    20668.0
Name: Balance, Length: 95, dtype: float64

In [ ]:
3#Merging and joiing Data frames